## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_public_ip.ghes_public_ip has changed
  ~ resource "azurerm_public_ip" "ghes_public_ip" {
      ~ fqdn                    = "ghsioux-welcomed-llama.westeurope.cloudapp.azure.com" -> "ghsioux-welcomed-rabbit.westeurope.cloudapp.azure.com"
        id                      = "/subscriptions/8564cd5f-4177-4e5e-8c9e-8932c69ceaa5/resourceGroups/ghes-rg-welcomed-llama/providers/Microsoft.Network/publicIPAddresses/ghesPublicIP"
        name                    = "ghesPublicIP"
        tags                    = {}
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.ghes_vm_replica[0] will be created
  + resource "azurerm_linux_virtual_machine" "ghes_vm_replica" {
      + admin_username                  = "azureuser"
      + allow_extension_operations      = false
      + computer_name                   = "ghesReplica"
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "ghesVMreplica"
      + network_interface_ids           = (known after apply)
      + patch_assessment_mode           = "ImageDefault"
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "ghes-rg-welcomed-llama"
      + size                            = "Standard_E4s_v3"
      + virtual_machine_id              = (known after apply)

      + admin_ssh_key {
          + public_key = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDl9RK6aDpVT5bWH62SM6KL5dQ/Qp6L7RL+V6ULPsXufG5Z0sjyQatrt11BMIn9RyxXVqIyO+CXkKISS3YdQlTsBDohEogwBV00vxTC/rRftYT227qKkKcw36QXZs28gMPszVm2sHYbgGVV1AUSh7Fc8l3kKdObgCUPYC70+ZWDOdmSLiDt+2TOquGbp6KfFovphfGemMXY6vLHPYBeFEhw9LDa9AEz0paq8GcixPFk0NU4gH+Z9afoiAHvjnwLfNQ7AwPLMyQOG6qfPVqQOslogqUVjM7IyB3tNwcy+Yc8M+nVO/G9F3kHCNu3DGqxy3VA+IQgMhl0xrPWkCiOIyHhAl18/K3k0UnN/bquk7mqij2XLR+xipRLPIZOaEiHXzWf7oqGbVGjlfAznsJgkIvMaDjxXaUFZbi1U0Rb4FZ3aLqSwTp0BoXC4fwuzYzR7ze3EshSRrqIlqv85aosepcSjnvu10Z3RkNON8DkvEjdZEm7uFSgyLA/FZ6BDzDoWmc="
          + username   = "azureuser"
        }

      + boot_diagnostics {
          + storage_account_uri = "https://ghesdia.blob.core.windows.net/"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "ghesReplicaOsDisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "GitHub-Enterprise"
          + publisher = "GitHub"
          + sku       = "GitHub-Enterprise"
          + version   = "3.7.2"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # azurerm_managed_disk.ghes_replica_data_disk[0] will be created
  + resource "azurerm_managed_disk" "ghes_replica_data_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 250
      + id                            = (known after apply)
      + location                      = "westeurope"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "ghes-replica-data-disk1"
      + public_network_access_enabled = true
      + resource_group_name           = "ghes-rg-welcomed-llama"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Premium_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_network_interface.ghes_replica_nic[0] will be created
  + resource "azurerm_network_interface" "ghes_replica_nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "ghesreplicaNIC"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "ghes-rg-welcomed-llama"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ghes_replica_nic_configuration"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = "/subscriptions/8564cd5f-4177-4e5e-8c9e-8932c69ceaa5/resourceGroups/ghes-rg-welcomed-llama/providers/Microsoft.Network/virtualNetworks/ghesVnet/subnets/ghesSubnet"
        }
    }

  # azurerm_network_interface_security_group_association.ghes_replica_nsg_nic_association[0] will be created
  + resource "azurerm_network_interface_security_group_association" "ghes_replica_nsg_nic_association" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = "/subscriptions/8564cd5f-4177-4e5e-8c9e-8932c69ceaa5/resourceGroups/ghes-rg-welcomed-llama/providers/Microsoft.Network/networkSecurityGroups/ghesNetworkSecurityGroup"
    }

  # azurerm_public_ip.ghes_public_ip will be updated in-place
  ~ resource "azurerm_public_ip" "ghes_public_ip" {
      ~ domain_name_label       = "ghsioux-welcomed-rabbit" -> "ghsioux-welcomed-llama"
        id                      = "/subscriptions/8564cd5f-4177-4e5e-8c9e-8932c69ceaa5/resourceGroups/ghes-rg-welcomed-llama/providers/Microsoft.Network/publicIPAddresses/ghesPublicIP"
        name                    = "ghesPublicIP"
        tags                    = {}
        # (12 unchanged attributes hidden)
    }

  # azurerm_public_ip.ghes_replica_public_ip[0] will be created
  + resource "azurerm_public_ip" "ghes_replica_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = "ghsioux-welcomed-llama-replica"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "ghesReplicaPublicIP"
      + resource_group_name     = "ghes-rg-welcomed-llama"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
    }

  # azurerm_virtual_machine_data_disk_attachment.ghes_replica_data_disk_attachment[0] will be created
  + resource "azurerm_virtual_machine_data_disk_attachment" "ghes_replica_data_disk_attachment" {
      + caching                   = "ReadWrite"
      + create_option             = "Attach"
      + id                        = (known after apply)
      + lun                       = 10
      + managed_disk_id           = (known after apply)
      + virtual_machine_id        = (known after apply)
      + write_accelerator_enabled = false
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ http_url                  = "http://ghsioux-welcomed-llama.westeurope.cloudapp.azure.com" -> "http://ghsioux-welcomed-rabbit.westeurope.cloudapp.azure.com"
  + replica_http_url          = (known after apply)
  + replica_public_ip_address = (known after apply)
  + replica_ssh_cmdline       = (known after apply)
```
</details>